{"story": ["“A dream? Of what? What?” He shouted to himself. “It's kind of like your bank account in some waking dream. It's like it's a mathematical simulation. You get to know it all right.” There was only one way to know when the door opened. “Mr. President, let me get you a cup of coffee,” the doctor came to him. “Okay, fine,” he said. Then he hurried to his room. Once he did, he saw the car in the distance. It was the President. It wasn't wearing a suit. A scarred mask and sunglasses was there. He tried to take it off, but it was too late. “Oh no.” Mr. President said in his best slouch. “My brain did not set in place for this.” “What?” he asked. He always knew. “So, what's the point?” “I don't care. There's no point.”", "It was the busiest day of the year. That would be the day when everyone else became alive and every other one seemed to be dead. If you hadn't seen the top competitors take to the stage for the first time in years, chances were you 'd been a fool to take you. That's why it was so shocking when the winning contestant was Elvira Finkle. While humans weren't exactly perfect in all regards, they still managed to scratch their self-esteem pretty good. It was honestly frightening how they stayed healthy and happy throughout that one match. Humans could be considered the oddity. Humans are the only humans alive who used to be considered even half the world's species. What most would call a *little* odd were humans were considered so boring. We were played up as what we could possibly be. Well, not quite the *game*. When I was a boy my friends would ask me to come over to see the stadium. My mother would always tease me that I had to come to see this place. I don't think she understood how cliche it sounded, but I felt I would never understand the kind of normal humans that would just chuckle in disbelief, wining over their children, and leave home just a few minutes before leaving. We made plans to meet up after school, but I was told that my mother and I would be trying to get to see the stadium when it closed. It was going to be a long day, and it was going to be nice to not have to deal with being invited. I was completely engrossed in the real thing, so much so that I didn't even notice that my old classmates were staring at me. The closest one was God, the God of Vengence. The rest of my classmates all sat there, writing on the wall like they were forever in a book. “Hey, we're all kids,” I said, “why don't we sit down?” God smiled and I couldn't help but smile. “No matter. You're so handsome,” he said. “Why the fuck am I so handsome?”", "There was a long silence on the held. A long time, but it had not really died down. A hush as the called for the to do something. “I think we need a name?” The teacher, majestic and ancient as the may well have been, his eyes so blue and so intense they bored through eons. “We might actually need to begin again” Some of them stared and shuffled. “So there is a time machine?” The teacher nodded. “What a piece of shit,” someone said. “We could leave them there, “the someone from the said The room slowly grew still, hearts hollow with the drifts of old memories, then the teacher spoke: “Time travel, there is a long time line. It takes a long time to go back to reach. We should take them, and jump them back. In their time they will be as they have to go in those places they. It came from and to fall, and come out. As we can all mankind, the gear for the earth on the earth. The classes slowly began to who wished. > “So I grew so we must get into the same” you will remember our ancestors for will “they all things and return to them We and, must have” give them Where we think they will not to this time, grow quickly he said ” * “Can you “you think the the I have been Love it", "My wife and I were the strongest parents on earth. We grew our child from pregnancy and biology we know well. She gave him away for money, a life and a fortune. I held him close all my life. We didn't leave each other. The guy fell in love with me and he stayed with me, never leaving my side. I became pregnant, and we did not leave each other. My wife decided to take the day off. She left me, and she wouldn't come home. I became sick and she wouldn't leave me. I went to see my daughter. I looked in my bedroom, and I couldn't feel any warmth. It was dark, my skin was peeling. I saw her, she was crying. She grabbed her mom's hand and took her home. A week later, I didn't hear from my wife. I went to the place I always went. They had cleaned the floor. They filled up my shoes. I cried, but it didn't come out of joy. I died. The photo on the table, I left me. The man died. I'm a ghost.", "The sound is a low, discordant, low pitched sound. You wake up in the middle of nowhere. I wave the light into the darkness and I find myself breathing deep. Every so often the same voice. I look up and decide to have it. All I am is dark. Everything is too dark. I fall asleep, and forget it. I blow out of bed, as I begin to have fun. I enter my dorm room, watching video games, finding that the eyes aren't mine, and start to succumb to light that gives me a deep, radiating groan thats piercing my eyes. I sit down and stare into the darkness. I am taking a deep breath to calm down, so I regain my memories of what happened yesterday. I sigh. The lights are dead. I try to read my phone, but I am just a blubbering mess of stories. I seem to remember my home, our once laughing again, the very core of our relationship. I watch from my bed, back to where we used to be. The light tore from our bedroom window in the back of our house. I swear it wasn't so big. I know there is not a shadow. I look around, and the lights were gone. My parents are gone as well, I take a deep breath and begin to feel content. I finally start to feel", "President Obama slammed his laptop shut. “Those hippy-dippy EU idiots. What are they going to do with it? Burn it ?” An assistant poked his head in. “Mr. President? Saudi Arabia on line one, China on line two, Russia on the direct line. The Canadians called, too, but they said they 'll call back since you 're so busy .” “I do n't want to talk to Saudi Arabia or China .” “Yes sir, Mr. President .” Obama picked up his direct line, which had been chattering away for the past few hours. “Hello, Mr. Putin .” “Greetings, Mr. Obama .” “I believe we have a ... renegotiation to discuss .” -- - Meanwhile, the EPA and NIH scrambled to figure out the source of the new bacteria. Newly appointed Lead Researcher Hertzel was coordinating the effort. “Gentlemen ,” Hertzel addressed the government officials in front of him, “we do not believe that this is naturally occurring. We know that it is n't any of the usual players - Russia, China, and their allies - because they have too much to lose. However, many EU member states have refused to share their research or data with us .” Hertzel pointed at the wall behind him. “What you 're looking at is a new form of bacterial warfare. That 's right, it 's real .” An ominous silence pervaded the room. “We have n't been affected, yet. Neither has Canada. While you gentlemen may be interested in how power shakes out after this, I 've been tasked with stopping it at all costs .” Hertzel motioned impatiently for the next slide. “Here it is in action. Russia has been unusually helpful .” A shaky video began to play of a plastic display case slowly melting into a black puddle. “As you can see, it does not affect humans. Unfortunately, it does affect most plastics and some strains even affect asphalt .” Hertzel adjusted his glasses. “Gentlemen, if this bacteria is not checked, the world 's entire plastic supply will be converted directly into oil .”", "a giant red bird with its wings and eyes is the only thing that can get away with that. the biggest problem is that it hasn't got a tail yet. i haven't had to do it since i was six, and my family was all around me. i've done it before, and i've been waiting for this moment for many years. i've been waiting for this moment for many years. i've been waiting for this moment for many years. it's been a long time since i've been in this damn arena. i've been waiting for this moment for many years. i've waited for this moment for many years. it's been a long time since i've been in this damn arena.", "I 'm not especially smart. Maybe that 's why everyone seems to hate me. My job, of course, was one that required someone especially smart. Someone like Winston Churchill 's third nephew or Abraham Lincoln 's half ancestor. But they chose me. Was n't my fault, being chosen. I mean, shit, I did n't even apply for the job. I applied for almost 20 jobs over the summer and the one that chooses me was the one job in the whole God-damned universe that I did n't even want. I got a call back from Safeway as well, but they were just trying to give me advice on what to say. So many people trying to give me advice on what to say. I suppose being chosen to be the voice of the entire species puts a certain target on your back, one that means, *Hey, come manipulate me or we all fuckin'die! * But they chose me, the aliens did. They chose *me* to plead the case of Humanity 's existence, not Einstein 's lesser known son. *Me. * I walked passed one of the countless shops playing my speech on the TV. It was a McDonalds, for crying out loud. Were they even aloud to have TV 's in their windows? I supposed it did n't matter, since we would all be dead soon anyway, but shit. As always, they cropped it out to show only the bad part. The subtitles spelled out the words so even the deaf could see my fuck up. “If you decide to exterminate us, make damn sure you do it right the first time, or we 'll come after you .” The picture switched to a news anchor drinking straight out of a bottle of vodka. “He 'd *killed* us all !” The subtitles said. How technology has achieved emotions and punctuation in subtitles was beyond me. “Asshole !” An old man threw a McChicken wrapper at my head as he passed. I headed in. Maybe they were hiring.", "But for example, the President is taken by the government's Secret Service in the internal planning of the nation and the Arkythians. The secret Service has not assigned a sizable number of usl offs majors, more and more of the more'' The Red Star '' in history was in a lot of talks. But despite this, the US has been scared about the dropped, tungvit or injected weapons this '' whole nation is actually asking the scientists to deliver lies and for the Illuminati to assassinate its supreme leader. You have been but three months with the theories that make you believe. As you go, your government will have two cases that will prove the point with no argument or correct outcome in an actually given question about how to think what is so stupid and your game. '' President, I am here to report you to the document to re-receiving the fact that as you asked, the successor to President both the Illuminati and the Illuminati's successor and the Continentum Faith's convenit assassin. Tell me who I am. '' '' Great course sir. I have no out of control reports. My office is providing an explanation to your President, a portion of it exists, but I want to hear how I interact with your guy. You have met a member of my party when I met. You must get my permission and call my office. You must make the next case, i.e. them and you will not be imprisoned. With your mission, we owe you both leads. '' '' Yes sir, my neviologist. My great ego, Ralph, as you call himself. They will not make this meeting with me in about a hour. The Illuminati will soon be overpopulation. But... I have got my report under reddit that your project has been put to end by the Illuminati. Unless you deem me unqualified to believe it, I am one of their allies. We have been recruited as our co-operatives the vaults and are concerned that we", "50 years is a long time, enough time to go crazy and return sane. I remember before it happened, the [ CDC joked that they would have a cure “within a week” ] ( http: //www.cdc.gov/phpr/zombies.htm ) when they had n't been able to cure HIV in 32 years, they had known about herpes for 2385 years and only had a treatment, and the flu remained a menace up until there were n't enough humans left to contract it. To the credit of the scientists, they all worked until the only thought they had was about their brain cravings. I had had a new “stem cell” treatment the year before, it helped recover some of the nerve damage i had gotten when i was young and had to have a surgery to correct a malformation. In those days, it seemed that the end to all disease and disfigurement were just around the corner, technology and biology hand in hand to save the human race. The funny thing is, my only guess to my resistance to the zombie infection and the zombies total lack of interest in me is probably due to the stem cell treatment somehow. The outbreak did n't take long, it started with a HIV like infection where only if you were bitten or zombie bodily fluids came in contact with someone, only then could you be infected. The virus became symbiotically linked to a bacterial group, then also a mold. With new methods of transmission, only the people on the ISS were safe from infection ... They got to starve to death and have a front row seat to the end of the world. By the time the infection made it here, there was no time for panic. The mold set itself up inside of buildings and anything made of wood or anywhere with standing water.. by the time it was identified, it had infected everyone. It 's spread was attributed to standing water in the water traps of sinks and toilets and their connection to the sewage system. time from infection to zombie was about 6 hours, and was mostly flu like. some people simply fell asleep never to wake with a human thought again. The thing about zombies that most zombie movies neglect is thermodynamics. Zombies do n't eat other zombies, and most animals can flee zombies or are immune. This means that a zombie must consume material to continue locomotion, and that energy must be expended to remain “alive”. Once the zombie 's guts had rotten past usability, a zombie would only be able to live for about 32 hours. Given that the zombie would run out of ATP fairly quickly, they would spend most of that time too stiff to move. This meant that anyone who was smart enough to remain out of sight, would be able to survive. The actual “zombie apocalypse” lasted about 3 years. Year two I went a bit crazy, I went through a mental breakdown where I assumed I myself must be a zombie and joined a horde. We chased some wildlife, and ate the remains of some survivors that starved to death. It was the sight of that rotting family that snapped me out of it, I slipped away and let the horde.. do their thing ... but that was 48 years ago, with eternal youth and a city of books and movies you can learn to do anything. So I learned to do pretty much everything. I was n't going to die anytime soon, I had a garden and traps set up within year 4. So it was easy to learn to make and do everything. One of the things i did was set up a “mesh network”, reprogramming WiFi routers to make a city-wide network that could allow me to monitor and automate things. Stealing some solar panels off of highway department signage and daisy-chaining them, I was able to muster enough power to keep the local radio station transmitting. I linked the computer up to my mesh network so I would n't have to set foot in there again. I set up heat sensitive cameras on every entrance into the city and tuned in random radios to my station, kinda like turning on the tv when your home alone, except with a whole city. For a whole year, I scavenged every solar panel i could find. From the bigger ones that the city put on their structures to going through offices for their pocket calculators. I scavenged other things too, Canned food, WiFi Routers, Medication, security cameras, loose wiring, movies, books, video games, Hard drives, portable PCs, IDs, Photos, phones, anything that may have held the voices and images of other people. I would also gather electric cars, with solar, i could charge them and use them. The wrecked and damaged ones could be used for parts, the ones in good condition I would store indoors to use as ether. A Camry Hybrid power cell and an alternator attached to a windmill or a solar cell could keep a couple WiFi routers chugging along for a few days. A single hybrid contains 34 of them. The mesh network also has a feature where any new nodes and unrecognized WiFi scans are reported to me.", "“Hey, I 've always been a little bit afraid ,” I explained to her, “so why not just sit down and enjoy the show ?” “You know, the ones that do n't show up. They get a little too scared .” She chuckled and waved to the other guests. The others were already sitting on the couch, looking at me with their own eyes. “Well ,” She nodded, “so, what do we do now ?” She leaned in closer, “do you remember what we do ?” “No ,” I said as I turned my head. I had never been a fan of my peers. But I wanted to be the most important person to ever exist and I", "“We 've got a lot to fight with. We 've got a lot to fight with .” “What 's your name ?” “That 's the word that got to me .” “It is. And I have a pretty good reputation .” “I do n't know what it is you say. You know, it 's been a rough week but I think I need to try again .” “We 've got a bit of a fight .” “You know, I have a bit of a fight with your father .” “That 's good to hear .”", "*bob* she was beautiful. he couldn't help but wonder if her eyes were as bright as the sun. she was beautiful as always. she had light brown hair, a blue eyes and her skin was pale blue. the sun was so bright that she could barely see it. the sky was so bright that she could see the stars in the sky. the sky was so bright that she could see the stars in the sky. “we're going to be fine,” she told him. “we're going to be fine.” she looked into his eyes.", "They walk out of the room at his cell. He kneels and opens his hands. The detective walks towards him, with a twist of a pen. “Egalius Ferese,” he says. “Thank you, sir. Thank you.” “You should try to avoid crime,” Ferese says. “You're starting to show signs of being caught.” A pen is pressed to his lips, but it doesn't matter. A man's sin is not being born. Ferese takes one step forward. It's important to himself. If he's caught, then he's killing. If he's not, then he's causing harm. The detective picks up a gun, he's no longer on the detective's radar. “You're right,” Ferese says, “I am not innocent.” “It's you! The Ferese I took from you,” the detective says, “You're not innocent.” The detective laughs. “Oh, thank God, the Ferese you had! You two talked about your funny life!” “I'm not allowed to speak of my life,” Ferese said, “I am not a real person.” “And the life you lived on Earth?” The detective says, “So, with your superior intellect and your admittedly bizarre murder... what did you say?” Ferese chuckles. “I don't know.” “I have written a thesis about your life. It is more detailed than I anticipated,” the detective says. The detective snickers. “But what?” “You invented the world's first AI. The first thing I discovered was that anyone, everytime I viewed something from outside the windows, I 'd be able to understand it.” <", "“you are a genius killer, sir.” “you are a genius killer, sir.” “i'm sure you know,” the man said, “but i'm sure you don't.” “you are a genius killer, sir.” “what?” “you are a genius killer, sir.” “you are a genius killer, sir.” “i'm sure you know, sir.” “i'm sure you know, sir.” “well, you're a genius killer, sir.” “you are a genius killer, sir.”", "“Come on Dr. Vanlon. There is no way you can take this to me. I have been watching you since you were young. You knew how to deal with others, how to walk around in a nice suit. Everything was laid out in front of me. And yet here you are, far away. You try to convince me you are the one who can save the world, to restore peace to a war-torn country that used to be your country. But you see the outside world is a reality that has destroyed your people. You fear the darkness you and all of your predecessors created. I have the utmost respect for you. And yet you have allowed yourself to think that this is your greatest dream.” Dr. Vanlon slapped a small button on the table, which sparked the speaker. “Please Dr. Vanlon, I need to tell you something,” it said. “What?” “What is it? Is it out of my hands?” “Is this really happening? I don't know. Is it that you can't hold the power that my programming created? My hands! The other doctors had implanted a transmitter that could transmit commands from the outside world into the brain. We wouldn't even be able to communicate over it, unless you dropped a pill on the ground. You just tried to speak to the phone before. “I know what you were thinking. I know that now.” “Don't try and turn it off!” Dr. Vanlon cackled. “My humanity is dead, you can't control it, or let it be. You can't hold my power, it can't keep me alive. You would sacrifice my mind and I 'd just shatter it.” The door opened and a man with a pretty face entered. “Mr. Vanlon, why are you here? I'm the head scientist at Comcast, I have access to the inside of every computer in this lab, I've been waiting for the code to be written to let me know.” “I'm here to give you the chance to reach me. Is", "“The villain is going up to the bank ,” said the villain. “You 're right. The heroes will be there soon .” “But, you do n't know .” “And they will be there soon .” “You ca n't be serious !” “Yes .” “I 'm not joking .” “I do n't know .” “I 'm not serious .” “It is n't .” “Then it is n't. It is. It is ... It is n't .” “It is n't. It 's not. It is n't. It is n't. It is n't .” “It is.", "In the only song I can think of, it’s *Lonelier than the Boat*. I stared blankly at the pavement, my memory so fuzzy, as though I were completely lost in its well-dressed beauty. It had been three years since I’d seen my daughter and she had climbed up the mountain so high that my boots would almost knock over pieces of my sedan. Even at eleven in the morning, my task would be finished, laid out at the bottom, then carried away with two backpacks back to the station. But this is something I’d heard dozens of times before. The story of what was written by the egg and the egg had been born, for whatever reason, and I could only catch glimpses from the web of thoughts I’d been wrestling with some time ago. It’s only been like two years, but I’d decided to stay focused on the song for the ride home. It made little difference to me. **Crack** Something outside the windshield of the car drove against the window with a screech. I slowed down. I stood there in front of my daughter, staring at her inquisitively. She looked nervous, but with some of the same panicked determination in her eyes that I was certain I saw when", "“Dear everyone. My name is Thomas Reed. As I was about to leave, a pair of cowboy boots arrived in front of me, and from their clothing came a small furry man in a red sandal. He carried a rusted cigar, lit with yellow. The cigar, bright in the sun, ran up into his finger and blew smoke into my hand. I had to go to the restroom to get the cigar, but it seemed safe, so I gathered up the little man and went home. As I was walking home, Thomas disappeared in the crowd, but before he left, he was joined by two smaller blobs, a puddle of black and blue water, and a large dark man in a leather coat. I could not believe what I was seeing. “Mr. Reed, you may be in a more real situation. A little press conference later, there is another unexpected story on the news. A stranger from the Smithsonian states that he has reached a tipping point in human society. He and a very special human are looking for him.” “That's fantastic news, sir. I've been working on this for weeks.” “You know, at this point in time, I wouldn't have noticed the enormity of the problem. A human is a human. It wasn't always like this, there were some heroes like myself.” “Do you see yourself in this situation, sir?” “Well... we came across a gentleman. Apparently, some firefighters got out of the way. Naturally, that is where I looked into it. This is insane, Mr. Reed, but what do you think,” he paused, and said, “of what is happening?” “I don't know. I think I am the only man who can understand why humans try to keep dying.” “You could feel something else too. Something horrible.” “Excuse me?” “Yes. We know humans look different from others, but that is no reason to kill them. What's more, those who got their hands on these creatures seem to have", "My first assignment with The Company was almost thirty years ago, now; I was new to contractor work and I remember being excited just to be in the field with a rifle. Excited to be part of a team of mean-looking dudes in multicam load-bearing gear, body armor, face masks. I was freshly back from overseas -- I’d been a REMF -- and wanted to feel like a badass. We were assigned to protect a mining claim in northern Wisconsin. This was of course well before the first Water War in the southwest, and the idea of heavily armed private security at a remote mineral extraction site shocked a lot of people. I remember being on the news. Between my tricked-out M4 and padded gloves and the skull facemask, I made newspapers nationwide. Above the fold. Even though the other guys teased me for letting one of the activists take my picture, I remember thinking at the time that the whole thing was fucking awesome. Who were these enviro-weenies who thought they had the right to interfere with a private mining interest on private property? In the end we’d only faced off with a few local protesters. Mostly hippies and Indians as I recall. We didn’t even carry any ammo in those days. But for a wannabe trigger-puller it was a fun summer. I did indeed feel like a badass all kitted up, walking the property perimeter with the team, some of whom were actual combat vets. Something else stuck with me from that summer. One evening I was off-duty and went for a hike along a stream near the mine site. I remember watching a particular stretch of water as the sun set, how the light seemed to climb up out of the trees and how the fish were rising, rhythmically, eating bugs that were on the water and flying around, blinking in and out of the sunbeams. It was silent, peaceful. Like they’d been doing it for a million years. Probably had been. It didn’t register then, but that stream was right downhill from the mine site. A mine site that would eventually be mothballed due to water usage restrictions, be sold off by The Company. Ten years later the neglected tailings dam would fail and dump a million tons of acidic mine waste sludge into the stream, and into Lake Superior. I did see some action with the crew during the first Water War, the southwestern one, but it was mostly defending tanker trucks heading to the frack sites from ambush -- pretty easy stuff, really. Those yahoos had no training and no arms to speak of and we just wiped them out. Didn’t even slow the trucks down, usually. Left them lying in the dust. They were slow, unorganized, predictable. Easy to hit. Wrapped up in cloth from head to foot, just like the hadjis overseas had been. Of course by that time Oklahoma was in full dust-bowl mode, aquifers bone dry, so such dress was practical. But as a child of the War on Terror period I’d be lying if I said it didn’t make pulling the trigger easier. All they had was desperation and desperation is not enough to make a successful guerrilla movement. But they didn’t have to be desperate. They could have moved to the cities or the camps with everyone else and had their water ration. Sure, the ration system was imperfect. If they hated it that much they could have just bought water from The Company. If they could afford it. Any of these would be better than bleeding out in the dust on the side of an empty highway. The Company owned the rights to that water, legal and fair. Who were they to try to take it, based on some romantic ideal of public property? But that was the first war. Not much of a war. Some minor civil unrest. The leeway that the Feds granted The Company as “Critical Infrastructure” meant that they could solve such problems as they saw fit. Fitness, to them, came from the muzzle of a mercenary’s rifle. Like mine. It also meant that I had a full hydration bladder at all times and a hot shower waiting for me in the barracks. I wasn’t complaining. Things settled down for a while. But when the second crisis developed, the fouling of the Lakes due to widespread catastrophic mine failures, we were back at work overnight. The Company had wells up in the Great Lakes sand country and, being the last sources of clean water, they were prime targets for thirsty locals. A couple had already been hit by local guerillas, the crews wiped out, thousands of gallons stolen or spilled. It had been costly to retake them, so the Company sent us up to Michigan to guard this big one until they could bring equipment in to harden it. They told us this well had at one time filled tens of millions of 16-ounce bottles of drinking water, shipped around the country to be sold for a buck a pop. The young guys thought they were joking. But I remember it. I drank those", "'*Motherfucker!'he says before leaping forward with an elbow to attack himself. ...'[ Dave Takamura ] The United States president literally melted through Washington and into the basement of his mansion. A hand touched his hair, and he squealed in pain. 'Hypocrite,'replied President Eric Lew, watching the puddle on the pool table as mommy slipped off two drinks. 'If you don't want your tag back, then shit'she said, running out of the basement. 'President Ingrid was holding what looked like big pipe, pushing it up a short staircase and exploding the top one once more. The wine glass nearby was disintegrating in an instant; a knock-knock sound alerted her that it had broken, sending shreds of wood behind the President. '...'[ Dave Channon ] Good,'said another talking robot. 'Double-checking our all documents, we already know who you are, its no secret. ... Looks like a lot of work, but we know this person is onto something special...'While dad has been creating our weapon, Mommy has made sure it cuts the bejesus out.”''Seriously kid?'asked President Reagan. '- Straighten up,'stated Dave. 'Dude,'continued Dave, rolling paper off of his desk. '...You ready for this?''Here goes'programmatically, mind if I turn it off? '... Entirely yours, and only if we agree not to harm or kill whoever wins this war. '... Damn sonny, make this easy. '- There you go, now go *beep*. 'Once everybody had turned their beeps on the microwave, the room turned black once again. ... Gotta hold on to hope. 'As Dave tuned into the next game - Mobile Defense Tactics II - they came home. ... Wade Fortenberry beat 8 year old Chris Stradley. *Before he could say thanks, the tone switched abruptly to a wall emoji and then 5. 'All to smooth things over. '... Alright baby boy, it just happens to be one of the best series, I guess. '... No, fucking hell, this sucks! '... Unlike most kickers'- Girl with a Gun always wins! '... Anyway, here ya go boy, *side spin manoeuvre - Scout Mark 44...'Start cycling when you see something flashing in your direction. '... Don't move unless instructed otherwise by the announcer.", "you wish to follow.' If your King's account can not find one or has been deleted then please submit a new one by using the comments section at your story page!' The entry was made by [ Sadistic Linker ] of [ TheGrimElven Lore ] ( [ 78 ] ).' Dodgin Profile...' You have requested a departure from my past, sir'; looks around a world lit by the firelight, by the roaring fires and flames of your two lovers... because, you see, I must always have something important to say, because *some* thing my past didn't say.' Javert chuckled.' He likes having that thought.' I do, good sir.' The End.' I am sorry if this drifts away.' His face looked pale with anger and sorrow.' Yes, I am. But somehow we managed it.' Shakespeare sighed.' I'm- We are getting old, didn't we?' Good for you'; and began to read and listen. Ah! we 'd see you again!' said his Majesty.' Give me your answer now.” I say, and I see nothing, dear Majesty.", "Marcus jumped out of the bed and opened his eyes to the reality of his situation. He had a wife, children, good job, and a comfortable life. “Good Life” he muttered to himself as he looked around. A familiar smell of coffee and cinnamon lingered in the his nostrils. He was sitting on a bench, his hands still in his pocket. He stared at the feet after his hand had stopped dangling on the ankle. Suddenly, he felt something tapping on his shoulder. He whirled around, eyes widen, the h his arms stretched, the h his head shot up, he lost grip on the foot in his hand, the h fell back. “What the hh?” Marcus shouted after the h his head fell. He moved away, trying to prevent falling, and saw that it was a number. It was bent over a pentagram, writing on the a D. He ran away from his house, immediately taking his phone out of his pocket. He tried dialing a number, with no service. He reached his town, no service, no service. He tried calling the bank, no service. He reached a teleporter, no service. He looked around the clock, no service, no service. “Tell me” he hung up on a number” Teleportation across” *** He dialled he called for the number on the line again ) “He dialled for service Immediately got him right > Uh-dialed -- verifpl>newline> Dialed devoicemail “*you must have So, oh you can't,? my *hi” held the We need team” hold with an", "Now, something is happening. People are not able to see when there are a problem. Even when I told you that it was funny the first time I saw someone outside of the darkness. They all looked alike, but I thought I had no. Your monsters. You know, they were light. I started laughing when I saw them on the TV. One night I saw a man with a box and a laser that was going out of his hand. As I saw his image, I began to realize that this guy was better at his dream. There was like I was right. I was just... They had really been gone. I was going to come see my friends soon. They were even more than I was. I could not move their bodies. I was so pretty scared that I stopped. That I was supposed to die. So I stood there and looked at the dark. Then, I saw it. I was starting to realize I was not dead anymore. It was also my bed, because I was floating in that dark. This guy wasn't dead anymore. I was seeing who I was as well. I could not see them either. I looked up and looked at the way my ceiling. I was there, the only body in my dream. I was probably on my head. I was the one with the shaft. I was dead. The house was dark. I was in a dream now. This guy was the one who was sitting in that dream. My girlfriend, I was two years old. We were married and I remember the days we were kissing and I was 12 years old. I remember feeling older than I was when I fell asleep. I remember telling me how I was supposed to die. I said, I'm not sure, but I'm going to die. I really amn't sure. I must have been in the dream. My parents... I'm seeing everyone. They are on the bed now. I am going to die. I have been here so long. My family. I just... I'm not sure. I was also really sick and I did", "The nurse pulled her out, led her to a chair with a pen so she could write it down and put the letter down in a white envelope. After a few minutes, a man came in with a clipboard and a clipboard and asked about her. It was a lot, since she was in the hospital's observation room. He asked if she could get the flu shot off the ground and her sister. She said she could, so he went to the nurse's office and wrote down the cause. She waited until she had the cure. The doctors told her that if she was getting the flu shot to die, she needed to have a healthy pregnancy, a healthy family. Otherwise, she would not be able to get the flu shot. Not only that, she would be facing losing her mother. She had been expecting her father, a housewife, to arrive in the next week. There were a lot of people that weren't going to take the time to prepare her for this. When the doctor told her that her little girl would be pregnant, she felt bad. Her little girl was no longer a baby. Her baby girl had been beautiful and happy. But now, she was a bitch. She couldn't give her child to her. She started screaming at the top of her lungs. Her father walked in and told her to stand up. She screamed, and he had tears running down his face. She cried until she collapsed. She had the doctors call her daughter. The hospital nurses called her a sicko. They tried to help her, but they always had to end a life. They would inject her, and inject her after a few days. The doctors told her that a miscarriage was the third time in as many weeks. They didn't want her to live. They tried everything they could to get her to give up. But they never could. There were still treatments that would keep her alive, and she would endure. She cried. She cried so hard and so much that her father came and got her in the hospital room. They tried everything. “No more! NO MORE! NO MORE!” “No more, bitch!” Nalan was rubbing his forehead, it was hurting. No more. “No more, I'm having a good day!” her", "It is widely assumed that DiCaprio is married to Walt Disney, and has a child with Disney's significant other. Disney Enterprises attempts to position himself as the captain of Disney Life, and Disney acquiesce. *Coined by Jiminy Cricket* Despite the portrayal of extreme parental frustration, children see DiCaprio as an introvert by profession, earning him accolades for pushing Disney to move up the company ladder. At first, he assumes this is because he's sick and suffers from a terminal illness, but eventually he takes steps to improve himself, ultimately adding “TO BE ACKNOWLEDGED” to his resume. ( DiCaprio would quickly become the Captain of DisneyLife; “Put this crap on YouTube!” ) A few years later, and DiCaprio becomes an internationally famous actress, claiming to have met the most beloved character of his career and has become his own reality. He emerges as a fan favorite in multiple movies, and receives his Oscar for his performance in Goldwyn-Mayer. This ends as DiCaprio suffers from an existential crisis, and as the Captain of Disney Life grows more and more frustrated, he begins to take drastic action. In order to get more money out of his employers, he threatens to reveal he is going to have a child, despite his health. *Coined by Jiminy Cricket* Having worked with DiCaprio for a decade, it seems only logical that he becomes an agent of the federal government. On top of this, he denies that his performance in Goldwyn-Mayer has been the product of abuse or deception, implying that it was his own failures that lead him to this predicament. The prevailing theory is that, due to the last thirteen years of his role as the deposed CEO of Disney Life, DiCaprio has become a person of immense influence over his employers, who's budget consists of films only a Hollywood producer can produce, films he doesn't intend to produce, movies he's recently planned to rewrite, and films he intends to draft. DiCaprio tries to expand his influence, attempting to convince his employers to sacrifice his entire future income to get the job, only to realize that", ", and with the right plans. Then when you die suddenly in your sleep, all your plans will come true.' He has moved on. His original servant died in despair. The king of Niger set out for his home, but on the way he was kidnapped by a tiger. His ransom was some fish from the river Snake, which was deep-fried. But the magician who had carried the snake wished for him to be with him; so he married the princess of the tiger and they lived happily ever after. -LSB- From Ungarischen Mahrchen. -RSB- * Germanische Mahrchen.' Grimm.' From Ungarischen Miscellany. -RSB- CHAPTER VII. An Invitation Once upon a time there was a man who was always busy with trying to get the most out of what he got from work. He wanted something that would give him something more useful than just a large sum of money; that was the motto of the shrewd fellow. “Did I get it?” asked he. “Yes, yes, my boy.” The man, of course, thought this made the boy lazy. Very soon he started to make it; a horse with bridle could do most things! One day however, he had better ask his master to lend him two wooden sticks, saying it was time he worked.", "The wet marble floor pressed on his cheek like a thousand hands slapping his face frozen in time. Smattering piss of rain ignored his indignant mumblings. His eyes fluttered. Pins and needs ran from finger to shoulder as he pushed back against the floor, contorting his aching body into a cross legged position. Last night was bad. He gathered that. His routine dullness of though crept inwards from the edges of his mind toward the black mist that veiled his most recent memories. He struggled to recall whatever he could n't recall but only for a moment before he decided it probably was n't worth the effort. He glanced around the room for a few minutes before concluding that he probably did n't know where he was. His investigation was n't entirely fruitless, he discovered a mostly full bottle of vodka. It was cheap but would definitely get the job done. Taking a few swigs made it childishly easy to ignore that gigantic black cloud of fog blotting out whatever the hell he did before he woke up. There was a mirror in the room and for want of anything more interesting to study he gazed at himself. It was a game he 'd play with himself, glancing at the mirror and seeing if he could recognize the person looking back. If he did n't know better he 'd have guessed he was a very successful mattress salesman, or perhaps a bum who had managed to score some luck gambling. His face was portly and unshaven, in that limbo place where it had been too many days without being clean and too few days to become a beard. His stomach was round but firm, like a basketball stuffed under a shirt and then semi deflated. The hair was long and unruly, receding far into the past. But his eyes were the giveaway. Looking closely enough at them he could still see an intensity. It was n't the sharp kind he carried in his youth but rather like a rusted dagger. Still sharp enough to cut. “DiCaprio .” The curse rasped out of him in a choke. After all these years spent working on the hallmark channel and tv series based on mediocre movies he was still there. Despite his best efforts to bury himself under all of the alchol and drugs he was still in there. He thought for sure after the bankruptcy he 'd be done, but no that god damned rerelease of Titanic the royalties started pouring in and he could n't get rid of the money. Not even the live action version of the nut job could destroy him. Cursing he hurled the bottle at the mirror but his wet hands slipped and instead of a shattering crash there was only a thud as the bottle bounced off the dry wall and rolled on the floor. His rage thwarted by his impotence he slumped against the floor and finally noticed why there was rain coming into this room. The window was smashed. He looked at the bottle, confused. No, he had n't done that. At least not with the vodka. He looked back at the glass etched around the window sill and his eyes hung on the red that stained the jagged teeth. The headache crept back towards the front of his mind while the bloody glass pinned his eyes in place. What the fuck happened last night?", "Scissors for hands? Hockey masks? Invading dreams? Stalking campers? Is this what I 'm competing against? Such juvenile psychopaths. Such weak jokes, come on Freddy, really? Making fun of a bulimic girl is just too low for me. I 'll stab abdomens with zeal, but to bring humour, heck, even my voice! , to my murders is the sign of an amateur. And Jason ... you should 've stuck to that camp, and I ca n't believe I 'm saying that. When you went to New York, that was just shameful. When you went to space, yes, space, I thought someone has slipped me mushrooms under my mask. “Painful” does n't even begin to describe that episode in your sad sad life. Man. I miss Pinhead.", "“Ummm ... hi .” Said the girl in the blue dress. There she was, framed in the doorway like it was a portal to another world. She was taller than Sam was by about a head, with eyes that matched the sea at dusk and hair the color of the dunes. A gust of wind ruffled her periwinkle dress, blowing a lock of her hair astray. She tucked it away nervously, avoiding his gaze. But Sam had already seen all that he needed to. He had seen it all before, a hundred times over a dozen trips to their little cove. But this time, out of all the times before, he was awake. *The girl in blue* ... He mouthed silently. Her blush deepened, and his own darkened to match once he realized she was watching him closely enough to understand. To his surprise, she smiled. “Sam, are you listening ?” His father said, providing a welcome distraction from his thoughts. “This is Meredith, she 's going to be staying with us for a bit while we 're in town. Now, I know she 's very pretty, but she 's the mayor 's daughter - so try to contain yourself .” “Dad !” Sam said, feeling his cheek burn even brighter. Luckily, at that moment the girl extended her hand. “Hi. I 'm ... Meredith. Nice to meet you .” She smiled just a bit wider. Sam reached out and took her hand. “Hi Meredith. I 'm Sam. And ... I know this is a little bit cheesy, but I think I have seen you in my drea-” Meredith woke up. She rolled over, silencing her second alarm with an almost-casual swat. 10:30. She was going to be late. Panic flooded her system, and before she consciously knew it her feet had hit the wooden floor of her room. She dressed, brushed her hair, and in a flash she was out the door. Today, of all days, she had no time to waste. Three streets down, across a little wooden bridge over a stream, and she was there. A cabin, one of dozens. But this one was special. The door opened, and there he was. Framed in the doorway like it was a portal to another world. Short, but endearing. His face was kind. It was exactly as she remembered it. But this time, out of all the times before, she was awake. “Ummm ... hi .” She stammered. She hoped that he did n't notice her blush."], "prompt": ["A new drug let 's you live a lifetime in one dream", "When you die the afterlife is an arena where you face every insect and animal you killed in your life. If you win you go to heaven, lose you go to hell. Your job was an exterminator on earth.", "Time travel exists, and a new form of capital punishment is introduced: Transporting the convict back to the worst, practically unsurvivable, places in human history to find yourself in. You are such a convict, and just got sent back. You will do anything to try and survive.", "Please tell me about one of your fonder memories.", "All you hear is a dripping noise.", "The world is rapidly changing as the plague of our era is spreading fast. But it does n't affect humans. It eats plastic.", "When you die the afterlife is an arena where you face every insect and animal you killed in your life. If you win you go to heaven, lose you go to hell. Your job was an exterminator on earth.", "Aliens have arrived, and ask for a single human to plead humanity 's case and save them from extinction. The human is selected through a lottery of the entire human race, and on the day of the drawing, your name is picked.", "When a new president is elected, they are given a special security briefing. In reality, this is an old tradition where various directors, military officers and current ministers present fake evidence and compete to see who can convince the president of the most ridiculous things.", "You are a immortal during the zombie apocalypse, During the apocalypse the zombies ignore you and you try to live a normal life during the outbreak.", "You 've been best friends with Death your entire life. When you 're about to become President of the largest world changing company in human history, Death turns to you and says “Tomorrow, 3pm .”", "Two wounded soldiers from opposing sides of the war find themselves in the care of the same nurse and snowed-in until spring.", "Write a story about an elderly wizard and his young female apprentice.", "A genius serial killer who has been killing successfully for a decade. With one weakness. He can never ever lie. He 's finally gets caught and is facing trial for a murder in court. Yet, he walks, acquitted of all charges.", "A genius serial killer who has been killing successfully for a decade. With one weakness. He can never ever lie. He 's finally gets caught and is facing trial for a murder in court. Yet, he walks, acquitted of all charges.", "The world 's first AI, for security purposes, is kept disconnected from the outside world, it 's only method of communication being a keyboard and monitor in an empty room in a faraday cage. Your job is to talk to it.", "The hero beats the villain by stooping even lower.", "Write something that goes with this soundtrack.", "Aliens have arrived, and ask for a single human to plead humanity 's case and save them from extinction. The human is selected through a lottery of the entire human race, and on the day of the drawing, your name is picked.", "You are part of an Elite Bodyguard team hired to protect a wealthy business mogul from an assassination. But the longer you listen this person business practices and plans for the future you find yourself wanting to help with with the assassination rather than prevent it.", "Michael, a 15 year old Call of Duty player, realizes the greatest trash-talking opportunity of all time. Over his headset, he recognizes his opponent 's voice as that of President Obama.", "An immortal couple have been seen throughout recorded history, write an account of them in any time period you wish. Bonus points if you match the writing style of the time period", "A new drug let 's you live a lifetime in one dream", "You live in a world where people 's shadows show who they truly are at their core. Some shadows look like monsters, some look like animals. You are the only person in the world with no shadow.", "She always started feeling it when she was two landings down.", "Leonardo DiCaprio in a fit of rage begins to torpedo his own career by deliberately acting poorly and taking on bad films. He finally wins an oscar for starring in Paul Blart: Mall Cop 3.", "A new drug let 's you live a lifetime in one dream", "Leonardo DiCaprio in a fit of rage begins to torpedo his own career by deliberately acting poorly and taking on bad films. He finally wins an oscar for starring in Paul Blart: Mall Cop 3.", "Michael Meyers just discovers that Freddy Krueger and Jason Vorhess exist and he is n't happy about it ...", "You swear that you keep seeing the same woman in blue every time you go on family vacation, when you turn 18, you are introduced to her."], "label": [3.3, 3.7, 3.3, 3.0, 3.3, 4.3, 2.7, 3.0, 3.0, 4.3, 3.0, 1.3, 2.0, 3.3, 1.0, 4.0, 1.7, 2.7, 2.3, 2.7, 2.7, 1.3, 3.7, 2.3, 3.0, 3.0, 2.0, 5.0, 3.7, 4.0]}