{"Summaries that contain significant factual inaccuracies or hallucinations, where the content does not align with the source document at all, will receive a score of 1. For instance, \"a summary that misrepresents the main ideas or includes irrelevant details\" would be deemed very poor.": 0.6215655316829611, "A summary that employs precise language and terminology consistent with the source text, enhancing clarity and understanding, will receive a score of 5. A summary that uses vague, incorrect, or misleading terminology that misrepresents the facts will receive a score of 1. A summary that uses mostly correct terminology but includes some inaccuracies or vague language will receive a score of 2 if the inaccuracies are substantial, or a score of 3 if they are minor.": 0.5324539793720044, "A summary that accurately represents the tone, style, and emotional elements of the original text, ensuring that the overall sentiment is preserved, will receive a score of 5. A summary that captures the tone but lacks some stylistic elements or nuances, while still conveying the intended sentiment, may receive a score of 4. A summary that conveys a different tone or style while retaining some factual accuracy but misrepresents the emotional context will likely receive a score of 3. A summary that misrepresents the tone or style significantly, leading to a different interpretation of the text, will receive a score of 2. A summary that fails to reflect the tone or style of the source text entirely, resulting in a loss of meaning, will receive a score of 1.": 0.49346134438708367, "Summaries that perfectly encapsulate the essence of the original passage, maintaining high coherence and clarity, will receive a score of 5. They should \"include all relevant information and present it in a well-structured manner,\" demonstrating a strong alignment with the original content.": 0.44162746620347954, "Summaries that are poorly organized, lack coherence, and fail to connect key ideas will receive a score of 1. They may \"contain irrelevant information or be overly simplistic,\" making it difficult for readers to understand the main points.": 0.4047032503634205}