{"story": ["The Talisman is a traditional, ornate, golden Aztec-ish figure. It has six slender arms and a long crocodile tail. I've had it for a couple of months, but I'd never thought I'd saw another one. Until today. I didn't get a good look, but the man was following me through the different Dimensions and the bulge in his pocket was flashing rapidly, so I assumed. I don't know how he was able to follow me through the Dimensions. He probably knows more about the Talisman than me, and was probably using it to track my inter-Dimensional trace? No idea. Pressing the golden button on the back of the Talisman, I shunted through the multitude of Dimensions. The Monochrome Dimension, The Womension, even the Dimazesion (I named them myself by the way ), but no matter what he was always half a shunt behind me.", "\" I 'm sorry, Mr. Gygax. I just want to get one thing clear. You're telling us that your games actually allow people to be able to cast spells? \" \" Of course. It works on the same principle as all other magic. If enough people believe in it strongly enough, it becomes real. \" \" So.. Santa Claus is real? \" \" An invisible entity that rewards good children and punishes bad ones? Of course he exists. There are plenty of children who believe so, and in doing such, make him real. There are also enough adults that do not believe in Santa, so that is why you don't see a jolly fat man in a flying sleigh travel across the countryside. He just works very subtly. A boss suddenly deciding to give out a Christmas bonus. A five dollar bill found on the side of the street.", "I am the detective in charge to investigate the murder I committed. Everyone is taking notice of me, people I can't believe even gave me the opportunity to open my first case. I only lost at my own game. At one point I would make a phone call to an attorney, would pay them a little money to testify in my defense, and sit back for a few days and take it all in. Now you wouldn't say I was above myself, but those little decisions of mine would seem like a red flag to you. I'm a fraud, a coward. Now you know why I called them. I was truly sick of what I did and wanted to do something right. The people who committed this murder are either crying out for help, or they know they've got nowhere else to turn.", "The harsh sound of traffic jammed her ears. Thunderous gales grew high overhead in a deafening patter of rain that mirrored the towers above her. She breathed in through a cracked, torn hole in her helmet, the sharp sensation of going to so much effort to escape leaving an audible crack. Blood rushed to the side of her face, the loud rumbling of her engines now muffled by the rain. Of course this wasn't the start of her shift. These were the last few left after one of the first big engagements. Everyone was dying, I supposed. \" For the last time. \" \" Fuck, man, \" I muttered. \" You need to listen to yourself. \" I glared at the radio, determined to keep going.", "Him, a vagrant. A drunk, a lunatic. Then I find him. His wife. That's the only word I can describe her. Her womanhood and dignity seemed to stretch on forever. A single throbbing pain in her belly. *sigh* That stupid woman. He was fool enough to get drunk with her! And, there. his wife's worthless form and hollow face. What a beauty, it would be so easy to squander his precious words! After all, my punishment of much less were punished much worse than this. Like the monkeys, being forced to learn about my words. But... I knew I would forgive him. He showed an admirable amount of dignity in the face of this rejection. But... my judgement was being clouded. *sigh* I suppose I had to get creative. I could've used pills. I could've just locked him in the cellar.", "The marble doors yawned shut behind me, I choked on the stagnant air. A film of dust hung in the air. It was cold, my skin rippled in this cold. The mighty hall in which I stood sat in the midst of a great forest. Marble pillars held the roof up stretching a football field's length high. The room itself was rectangular, shelves lined the room like book cases with a large aisle down the middle. Several more platforms of shelves climb along the walls. On the shelves sat weapons of all shapes and sizes, little note cards sat in front of them. There was no doubt in my mind, This was Heorot. I walked up to one of the shelves, on it rested a sword.", "I was working on his house when I heard a noise. Probably the neighbor prattling about my dog. I glanced up from my work and looked in the door. The neighbor was a woman with messy blonde hair. Her chestnut eye lashes blew gently in the wind. She didn't look up from my work. \" Maybe I 'll see your dog again tomorrow, \" I said. She raised an eyebrow. I laughed. \" Sure, \" she said. \" I have a dog. \" She kissed my forehead. She was no longer the woman I knew, and I smiled. \" Umm... where do you live? \" I asked. \" Park Hill, \" she said. \" My boyfriend's been moved away to Portland a couple of years ago, so he can't visit.", "Porphyria scion lived by himself. He never had any friends in the family, and was one of the few people who came by on Mondays. His is the first marriage in all the history of his species, and his second child was the result. Her name was Carol. * \" Sorry Carol. \" * * \" Er, that's not my name. \" * * \" Hmmm. So you are going to name your child Carol. \" * * \" No, that's not right, I'm going to be called Mother Maria. \" * * \" Okay Carol, so Carol's a name Carol. \" * Carol looked down at the nameplate attached to the chair she was sitting on. The ribbon in the handle was made of golden twine. As she looked up at the thick and solid oak tree on her window sill, she decided she wanted to scream.", "\" Hey kid, let me tell you something. \" Captain Kidd stared down the barrel of his futuristic *Stiletto* at the teenager, his eyes sparkling as he attempted to soften his heart. \"... *Ahem*... \" The teenager scratched his head, scratching his hair and disobeying his parents and older siblings. Kidd hated her for that. \" You're not listening to my advice! \" Captain Kidd exploded. \" You can't go back to the old days! \" \" I know, but why me? \" the boy stammered. \" Because there's more than just guns and sorcery in here, ahem... \" Captain Kidd straightened his tie and shrugged. \" Fine, let's see what I got, huh? \" the boy winced at the \" Stiletto. \" \" M'feet, get behind me! \"", "I 'll tell you a little story. Years ago when I was young and looking for love in all the wrong places, I noticed a hot (and I mean HOT) girl at a table with her not so hot female friend. During the course of drinking a beer I watched as guy after guy approached their table only to be humiliated and sent back to their lonely corner of the bar. It was then that I had an epiphany for a major score. I approached their table and without a single glance or word I starred into the homely lady's eyes and asked, \" I noticed you were by yourself and I would love to join you if that was OK? \" She looked surprised and said yeah that would be fine with her if it was ok with her friend.", "\" So, class, can we all remember the passage we read this morning? \" \" 'You hit the Lord of the Titans in the eye with a blue plastic hairbrush .'\" \" Yes, and why is this verse important? Stevie, can you tell us? \" \" It's important because it demonstrates the subtle power of the oracle, even before she was chosen by the mummy. \" \" Yes, Stevie, that's very good. Now Harrison, I see you have something to say on the matter..? \" \" Yes, Ms. Penny! I-I wanted to say ... I don't think that was the purpose of the passage. \" \" ... What do you mean, Harrison? \" \" I mean ... I thought it was supposed to express the importance of bravery, the guts Ms. Dare had to use such a little tool to attack the Lord of the Titans.", "I think this story, using its use of a different time period as a setting, has very strong elements in it. It is setting, but never quite moves beyond the setting. This particular aspect is also a little off. It moves into very serious topics which I found the entire story was concerned with, but it never really finds itself in the areas of the story I would ordinarily be interested in reading about. Overall, I think this is a very good story. If you have not already read it, it is time to do so. You have so many great ideas, and I am glad you are sharing them! _______________________________ One of my stories had a too deep structure and this fell flat in my favor. The character was there the entire time, but not at all the main point. I don't know what got in the way.", "I looked in the closet, moving some stuff around, hoping to find my old coat since my new one had broken. I felt a small box and pulled it out. It was a small red box, used for holding a wedding ring. \" Ahahaha, oh good memories. \" I said, remembering her, my wonderful wife. I remembered how I proposed to her, my face when she said no, the emotions that led me to sneak into her house, grab the kitchen knife, and stab her. \" Ah, the birth of the new and improved me. \" Of course, some of my victims say I am crazy and delusional, that I see things and I should let them live. I chuckled. \" Honey, are you coming to bed? \" My wife said. \" Yes dear, \" I said as I put the box away and walked to the room.", "* \" It's a very difficult competition, one you'd much rather not be involved in. Not that there are many of us left. \" * says Iron Chef Blake to a group of our contestants, mostly ex-comparison judges of our previous Iron Chef events. * \" You know there's a reason there are no chefs left in the world. \" * the youngest of the group replies. We sit around a small table, a man in a dirty t-shirt sits on the opposite end, all of us waited by him and one of the younger contestants. \" So what do you want to eat for dinner, \" Iron Chef Blake asked. * \" Our quest for the Orb of Fertilization? \" * \" Yes, of course, \" a goofy smile starts to spread across the young man's face. \" Now, what is our quest? \"", "\" I thought there were 7 deadly sins. \" I asked Peter. St. Peter looked at me with a sad smile. \" Of course there are, but that's not the sins that matter. \" So I 'm going to an Afterlife based on sins I've never heard about ?. \" I asked? \" No, not at all. I 'm sure you have heard of them. Come, I 'll show you to your gate. \" Peter walked me past The Gate of Chewing with your Mouth Open, past The Gate of Tailgating, past The Gate of Talking During the Movie Show. I was escorted past past The Gate of Littering, and past The Gate of Talking About Yourself in the Third Person. \" So what is the gate for me? \" I asked nervously. \" Here you go son, enjoy your Eternity. \"", "I stared at the ink on my arm, shocked and horrified at how it got there. How did it get there? I was terrified but I got out of bed quickly and called her number. The ring tone went on forever, and the moment I heard her pick up the call - when the ring tone went off and there was a pause, before her voice saying \" Hello! \" in her usual cheery voice - I hung up the phone. If she was okay, then why was the name on my arm? Could this be a joke? I tried rubbing it off my arm, but it wouldn't come off. Then I got a call. My roommate. \" Dude, where are you? You got ta get here. Quick, there's no time. \" As quick as he had called, he had no sooner hung up.", "It all began with a Facebook message. I have always had a creative side. In the last year I had just finished writing, producing and directing my own movie. As I was working on my next script, I got a Facebook message from a girl I used to go to high school with. Her husband was a friend of mine and we also went to high school together. He had heard that I recently made a movie and suggested that she contact me because she was trying to expand her photography business to include personalized videos, as well. She started sending me long emails, explaining her thoughts and ideas. The project sounded like fun, so I offered to help her shoot the first session, so I could also teach her about videography. Our emails about her business plan started becoming more personal, as we started sharing our lives.", "\" Alright, I 'm sure you've all heard about the recent developments in the Middle East. Anybody care to speak up? \" Simultaneously, all the heads in the room turned towards the United States delegate. The tension instantly became palpable as the silence hung in the air as the US delegate looked around the room, eyebrow raised in confusion. Then, it dawned on her. \" Oh yeah, sure. Nuke all the turbans because we're fucking 'MURICA! Give your oil to the land of the trigger-happy, home of the obese or we 'll shove 200 megatons of freedom down your face. \" she responded, her voice dripping with sarcasm. \" It wasn't us, you utter twats. Though our CIA knows that Japan's been up to more than next-gen consoles and DSLR cameras. \" she added, casting an accusatory glance at the opposite end of the room. BAM!", "It had been months since they found me dead. I don't know why I stopped walking. No-one else around to take my place, or talk with me. I spent days frozen in shock, never able to talk, unable to move, unable to express myself. It was a strange thing, nobody else would suspect me of wanting this. The more I focused on it, the more it consumed me. Years passed, and I got more and more lost in it. I began to think that perhaps they didn't really care about me. I still had a deep longing for them. All I had was so many steps to walk now. A quiet part of me liked to think that they had passed me by. The loneliness. It never felt like such a loss. They were gone, the ones who saved me. So why did I still keep walking?", "The scientist was shocked and shocked he was sure that this message would be fake. And yet he somehow had become a wise man. Of all the gods and goddesses in the underworld, he had become one of the smartest. The much loved psychologist, Marcus Petersson, had tapped into his inner ramblings of wonder. Marcus Petersson had been a prestigious psychotherapist in order to heal the wounded and break the bonds of the mentally ill, first helping to calm the crippled to stand back up after a brutal car accident, and later giving proper therapy to those who had suffered such a profound injury. And one day in the middle of a recent office break he had received a startling message. A message like this wouldn't come from any other source, and so he was certain there must be a hoax.", "Some light reading ahead, you can check out reddit if you're interested. A soft knock on the door startled me from my thoughts. I felt a cold shudder, quickly turning my head and peering into the room. A young man stood there, shaking on his heels, trying his hardest to make his voice hoarse. \" Please \" I said, \" I don't want you to hurt this man, but if it makes you feel better I'm here to help. \" I took another deep breath. I didn't want to hurt him, but if it was going to make me feel better, I'd better do something. \" You see.... you do this, you break the news, they think it's the best way to help you, the savior. But it's just plain wrong. \" He shook his head.", "# Odds Are # Survivor 10110, also known as Luke, had just gone critical, forced into an industrial building by a horde of well over a hundred undead. Pilots had seen the impending conflict well ahead of time-Luke's most recent looting hole, well out of the way of large, populated areas, had suddenly become home to a small horde, probably from the larger town across the way. His feed had been switched to the Pit several hours in advance, and, as predicated, a routine trip had now taken a disastrous turn. Seamus watched as former millionaires and celebrities began betting high end supplies, either brought with them to the Bunker or acquiesced by security men like Seamus. Cuban cigars, Rembrandts and Monets, cases of caviar, all useless and decadent items that had no bearing on survival, just comfort and bragging rights. But Seamus didn't particularly care.", "I was on my way to work. On a smooth, black, unlocked building in a nearby suburb. A well-dressed man sat, sweating, smoking a pipe. I couldn't tell if he was breathing or holding it. \" Call me Bill, \" he said. \" This is Lars, actually. \" \" Huh, ‘ a German man,'\" I said, thinking to myself, ‘ Interesting, if for nothing more than making a name for myself in the bank account, I guess. \" I swigged a beer and set down my bag of chips. \" What are you up to, man? \" Lars said. \" Nothing important, \" I said, rummaging through my pockets, ‘ No cellphones, no cameras, no internet, no TV. \" I threw my phone on the table and crumpled it. \" Hey, are you working in my place today? I think I might be an agent. \"", "\"... \" I said, trying to keep a cool tone. \" For sure, \" General Attilla of Azkaban said, visibly interested. \" You're the Chosen One! You're the person the Ministry of Magic just absolutely needs to hunt down and take away before he gets captured by the Unforseen One. \" I held my breath and leaned forward to look at him, \" Um, excuse me, sir? \" \" Sir, you're not in Hogwarts right now, the Defense against the Dark Arts professor and I are going to be there in a few moments, but sir, I know you have something important to talk about. \" I stared at him, mouth hanging open. \" You're being absolutely uncool! \"", "Lionel was surprised that he had worked up the guts to finally point the revolver at his own head, but he was even more surprised when a disheveled looking man with red skin, horns, a briefcase, and a suit materialized in front of him. Following a lengthy scream and the gun barrel shifting from one head to another, the Devil told Lionel to put the gun down. \" Just put it down. Easy now. Let's just have a quick chat. \" \" Y-y-you're -- \" \" Yes, I 'm Lucifer, the Dark Lord Satan and keeper of the underworld, but please, call me Lou. \" \" What the fuck are you doing here? \" \" I have some information I think you would be interested in, but first, for the love of the prick upstairs, put down the gun.", "My opponents stare at me like I'm some kind of clown ; bizarre and funny at the same time. They, well, my opponents look like clowns. Staring at me and the book I'm reading, their foolish attempts to deal with the seemingly benign conflict of a wizard and a gun-wielding killer are met with outrage. The cowardly and morally weak wizard, and the now-defunct gunslinger, but all heroes, no matter how cowardly, are still just as heroic as a good person. They must be thinking that I'm a good guy, to be trying to deal with a totally unbeknownst man, but I've never been one to call myself a hero. I'm not the first mage, wizard, or samurai to face their respective prince or heroine. Just like I'm not the first samurai to face his test of bravery.", "Leonardo DiCaprio made his way to the microphone, shaking his head. He looked a little manic in fact, as he let out a high-pitched sound of disbelief. The smile stretched across his face, but in an odd way, he didn't look very happy at all. He crouched to put the Oscar on the floor. Then he stood up tall, leaning into the microphone. \" I have two words for everyone tonight. \" \" Fuck, \" he said pausing to make a circle with his fist. He slipped his pointer finger into his fist, jerking it in and out, making what some might call a lewd gesture. \" You. \" He pointed at everyone in the audience, laughing for a moment, then conveying a mere micro-expression of pain. His face twisted and turned, as he conveyed the best moments from each of his roles.", "Seven cameramen jostled nervously for a shot of Alan's not-yet-famous burger grind. When he was eight, his dad had shown him some cool tricks with a grill that he'd never had a chance to use in his third-floor apartment. > \" Remember, son. Sirloin is what is going to make your burger *tender*, but the ox tail and brisket are to make it nice and *juicy*. \" The so-called 'secret ingredient'was easy to add as well ; Alan loved adding pineapple to my burgers as my local Asian delivery guy would be quick to note. My entree would be done shortly enough, and Bobby Flay raised his voice to two other sous chefs to prepare his Béchamel. His Pineapple Tuna Mornay was to compare to hamburgers ... but already he was breaking a sweat. 35 minutes remained for my appetizer and desert. I decided, what's better for dessert than pancakes?", "I didn't give up, though. I was stubborn. Sure, other business people had fallen. I mean, they had to do it. There was the deficit with the nearest raccoon, but *that* one *had* killed the cat. I've just brought a massive storm in on that delivery address and the poor cat- but I've managed to make it work. The delivery guy goes out on the street, bright and early in the morning, confident that the address he's giving me the night before is the optimal one for me. I follow him until he leaves, get inside, and set up shop. Pizza delivery. Oddity? I guess it was a bit of an abstract concept until I got a sack full of canned maggots and began to wonder if it was ever a thing. So, over a period of five years, I started feeding them human flesh.", "[ Beep beep ] went the phone. Who could that be? I looked down. The corpse of my last victim, neck chopped open. Entrails dangling. A job half done. The blade I place down on the counter, then I peeled off one glove and picked up my device. Unlock, bah ... fingerprint won't work again, 5 seconds wait. That 'll be the talc. Aha! A message. From Genre. Oh no ... here we go again. Tap open. Hmm ... this is going to be ... interesting ... With a dramatic twirl, the device was slid back to it's resting place, the glove back on, and knife in hand. \" HI HO! HO HO! It's off to work we go! \" as I started hacking away again, a maniac grin on my face as each word was sung loudly and clearly, to an audience that can not hear."], "prompt": ["You find an ancient Talisman that allows you to travel between universes, but you're not the only one.Another man also has this same Talisman, except he's a serial killer, and you're his next victim.", "DnD and other fantasy role-playing games DO actually give the ability to cast spells and gain supernatural powers.", "You are the detective in charge to investigate the murder you commited", "Turn your favourite song into a piece of prose/poetry without mentioning the song.", "How about a genie story from the genie's perspective", "You discover a grand hall filled with legendary weapons like Mjonir and Excalibur. Each generation or so, warriors come to the hall to inherit a weapon that they are worthy enough to wield. Across the hall you see a forgotten weapon that's been collecting dust. You hear it call to you.", "For the first time ever, a person is born with a genuine superpower. They proceed to live out their entire life without noticing or realizing it.", "The bone broke surprisingly easily.", "\" It's like Hogwarts, except with guns and explosions instead of wands and sorcery. \"", "The best male wingman on earth tries to help his friend score with a hot lady. Meanwhile, the best female winggirl on earth tries to make sure her friend (the hot lady) goes home alone.", "Several centuries in the future, your favorite fiction book is found, and believed to be historical fact.", "Loose Threads - 2YR CONTEST ENTRY", "You find an old object of yours in the back of the closet. Tell us about a single memory that slams into your brain when you see the object.", "You, a bachelor of 15 years, that's often too lazy to cook real meals, are somehow winning in an Iron Chef competition.", "after dying god informs you that hell is a myth, and \" everyone sins, its ok \". instead the dead are sorted into six \" houses of heaven \" based on the sins they chose.", "When someone is murdered, their name appears on the skin of the killer. You wake up with a name on your arm and no knowledge of how it got there.", "The most saddest love story you can ever think of", "Multiple nuclear explosions wipe out several cities in the middle east, but noone knows who deployed the weapons. This is the resulting UN emergency meeting.", "\" Every person sees the world in a unique way. When someone dies it is, in a way, the death of an entire world. \"", "Earth receives a message from space : \" You have been challenged to a match of Galactic Deathball. Assemble a team of 20 humans. If you lose, the planet will be destroyed. \"", "Write a story where the antagonist is doing something obviously horrible, but by the end of the story make me want to side with him over the good guy.", "Fantasy zombie apocalypse : The rich and powerful have grown bored. For entertainment they bet on the remaining survivors \" out there \".", "An alien race enslaves humanity, but we're fine.", "\" Sorry, but ... you're actually NOT the Chosen One. \"", "Satan prevents a suicide.", "You are the antagonist of the story. However, you aren't sure if you can call yourself that after what the protagonist did.", "Leonardo DiCaprio in a fit of rage begins to torpedo his own career by deliberately acting poorly and taking on bad films. He finally wins an oscar for starring in Paul Blart : Mall Cop 3.", "You, a bachelor of 15 years, that's often too lazy to cook real meals, are somehow winning in an Iron Chef competition.", "You run an interstellar pizza delivery business.", "We are all the protagonists of our own stories, but every once in a while a message arrives for you and tells you that your genre has changed. Yours has just changed from 'slice of life'to ... ?"], "label": [3.3, 4.0, 4.0, 4.0, 3.0, 3.7, 4.7, 3.0, 3.3, 4.0, 4.7, 3.7, 4.3, 3.0, 3.0, 4.3, 5.0, 4.3, 3.7, 3.0, 4.3, 4.0, 2.7, 4.7, 5.0, 4.7, 5.0, 3.3, 3.3, 2.7]}